# Notebook 2 - Crear y consultar una Base de Datos Relacional con MySQL

## Ejercicio 1

<b>Requisito:</b>
- Descargar el archivo <a href="./sakila-db.zip">sakila-db.zip</a>

<b>Problema: Un poco de retro-ingeniería...</b>

Tienen a su disposición el archivo sakila-db.zip, lo cual contiene dos archivos:
- 'sakila-schema.sql' : una serie de instrucciones en lenguaje SQL para crear una Base de Datos llamada 'sakila'
- 'sakila-data.sql' : una serie de instrucciones en SQL para insertar datos en la Base de Datos

A partir de estos archivos, el ejercicio consiste en deducir el Modelo Lógico de Datos (Modelo Relacional) y el Modelo Conceptual de Datos (Modelo Entidad-Asociación).

- MLD: <b>por completar</b>

- MCD: <b>por completar</b>

- ¿De qué podría servir esta base de datos? ¿Cuál era su aplicación probable? ¿Cuál sería una adaptación posible más moderna? 
<b>por responder</b>

## Ejercicio 2

<b>Requisito:</b>
- Haber terminado el ejercicio 2

<b>Problema: ¿Cómo importar una base de datos?</b>

Queremos cargar la base de datos 'sakila' a partir de los 2 archivos .sql a nuestra disposición. ¿Cómo podemos hacer?

<b>Ayuda:</b> Revisar la página de documentación de MySQL que explica cómo ejecutar instrucciones SQL desde un archivo https://dev.mysql.com/doc/refman/8.0/en/mysql-batch-commands.html

In [151]:
import mysql.connector
import pandas as pd
from IPython.display import display,HTML

#reemplazar 'root' por el password del usuario administrador de MySQL
db_connection = mysql.connector.connect(user="root",host="localhost",password="19941")
cursor = db_connection.cursor()
cursor.execute("use sakila")
cursor.execute("SET sql_mode ='' ")

## Ejercicio 3

<b>Requisito:</b>
- Haber terminado el ejercicio 3 y haber importado los datos en su MySQL local.

<b>Problema: Realizar consultas <code>SELECT</code> simple</b>

Desde un entorno Python (o MySQL CLI o MySQL Workbench), realizar los comandos SQL que permiten responder a las consultas siguientes. (No olviden utilizar el comando SQL <code>USE [database-name]</code> ;-))

<b> Ayuda: http://www.mysqltutorial.org/basic-mysql-tutorial.aspx</b>

1) A partir de la tabla "film", mostrar solamente cuáles son los títulos de pelicula disponibles.

2) A partir de la tabla "film", mostrar de qué años son las peliculas disponibles. NB: utilizar la instrucción <code>DISTINCT</code>

3) Mostrar los títulos de pelicula en la tabla "film" que se puede arrendar por más de 4 días (rental_duration)

4) En la tabla "payment", mostrar el customer_id, rental_id, amount y payment_date de todos los arriendos realizados entre las fechas 2005-07-01 y 2005-08-01

1) A partir de la tabla "film", mostrar solamente cuáles son los títulos de pelicula disponibles.

In [71]:
df = pd.read_sql('SELECT title FROM film LIMIT 10;', con = db_connection)
display(df);

              title
0  ACADEMY DINOSAUR
1    ACE GOLDFINGER
2  ADAPTATION HOLES
3  AFFAIR PREJUDICE
4       AFRICAN EGG
5      AGENT TRUMAN
6   AIRPLANE SIERRA
7   AIRPORT POLLOCK
8     ALABAMA DEVIL
9  ALADDIN CALENDAR

2) A partir de la tabla "film", mostrar de qué años son las peliculas disponibles. NB: utilizar la instrucción DISTINCT

In [12]:
df = pd.read_sql('SELECT DISTINCT release_year FROM film GROUP BY release_year;', con = db_connection)
display(df);

   release_year
0          2006

3) Mostrar los títulos de pelicula en la tabla "film" que se puede arrendar por más de 4 días (rental_duration)

In [69]:
df = pd.read_sql('SELECT title FROM film WHERE rental_duration > 4 LIMIT 10;', con = db_connection)
display(df);

              title
0  ACADEMY DINOSAUR
1  ADAPTATION HOLES
2  AFFAIR PREJUDICE
3       AFRICAN EGG
4   AIRPLANE SIERRA
5   AIRPORT POLLOCK
6  ALADDIN CALENDAR
7   ALAMO VIDEOTAPE
8    ALASKA PHANTOM
9    ALICE FANTASIA

4) En la tabla "payment", mostrar el customer_id, rental_id, amount y payment_date de todos los arriendos realizados entre las fechas 2005-07-01 y 2005-08-01

In [70]:
df = pd.read_sql('SELECT customer_id,rental_id,amount,payment_date FROM payment WHERE payment_date BETWEEN ("2005-07-01 00:00:01") AND ("2005-08-01 23:59:59") limit 10;', con = db_connection)
display(df);

   customer_id  rental_id  amount        payment_date
0            1       4526    5.99 2005-07-08 03:17:05
1            1       4611    5.99 2005-07-08 07:33:56
2            1       5244    4.99 2005-07-09 13:24:07
3            1       5326    4.99 2005-07-09 16:38:01
4            1       6163    7.99 2005-07-11 10:13:46
5            1       7273    2.99 2005-07-27 11:31:22
6            1       7841    4.99 2005-07-28 09:04:45
7            1       8033    4.99 2005-07-28 16:18:23
8            1       8074    0.99 2005-07-28 17:33:39
9            1       8116    0.99 2005-07-28 19:20:07

## Ejercicio 4

<b>Requisito:</b>
- Haber terminado el ejercicio 4

<b>Problema: Realizar consultas <code>SELECT</code> con funciones de agregación </b>

Desde un entorno Python (o MySQL CLI o MySQL Workbench), realizar los comandos SQL que permiten responder a las consultas siguientes.

<b> Ayuda: http://www.mysqltutorial.org/basic-mysql-tutorial.aspx</b>

1) Contar el número de clientes en la tabla "CUSTOMER"

2) En la tabla "RENTAL", contar cuánto arriendos se realizó por cada cliente (NB: utilizar la instucción <code>GROUP BY</code> y <code>COUNT</code>)

3) ¿Qué devuelve la consulta SQL siguiente?

<code>SELECT MAX(total) FROM (SELECT customer_id,count(*) as total FROM rental GROUP BY customer_id) as t1;</code>

4) ¿Qué es un sub-consulta?

5) En la tabla "payment", mostrar el volumen de negocio realizado por cada miembro del staff (staff_id) en total.

6) En una consulta, mostrar el staff_id que ha realizado más volumen de negocio el dia 2005-08-23.

1) Contar el número de clientes en la tabla "CUSTOMER"

In [39]:
df = pd.read_sql('SELECT count(*) AS total FROM customer;', con = db_connection)
display(df);

   total
0    599

2) En la tabla "RENTAL", contar cuánto arriendos se realizó por cada cliente (NB: utilizar la instucción GROUP BY y COUNT)

In [73]:
df = pd.read_sql('SELECT count(*) as total FROM rental GROUP BY customer_id LIMIT 10;', con = db_connection)
display(df);

   total
0     32
1     27
2     26
3     22
4     38
5     28
6     33
7     24
8     23
9     25

3) ¿Qué devuelve la consulta SQL siguiente?

SELECT MAX(total) FROM (SELECT customer_id,count(*) as total FROM rental GROUP BY customer_id) as t1;

Entrega el número máximo de arriendos de un cliente entre todos los clientes (46 arriendos)

4) ¿Qué es un sub-consulta?
Una sub-consulta es una consulta SELECT que se encuentra dentro de otra consulta SELECT, esta se encuentra entre parentesis. Cuando se ejecuta la consulta, se hace la subconsulta por cada fila consultada.

5) En la tabla "payment", mostrar el volumen de negocio realizado por cada miembro del staff (staff_id) en total.

In [52]:
df = pd.read_sql('SELECT staff_id,count(*) AS total FROM payment GROUP BY staff_id;', con = db_connection)
display(df);

   staff_id  total
0         1   8057
1         2   7992

6) En una consulta, mostrar el staff_id que ha realizado más volumen de negocio el dia 2005-08-23.

In [101]:
df = pd.read_sql('SELECT staff_id,MAX(total) FROM(SELECT staff_id,SUM(amount) AS total FROM payment WHERE payment_date BETWEEN ("2005-08-23 00:00:00") AND ("2005-08-23 23:59:59") GROUP BY staff_id ORDER BY total DESC) AS t1;', con = db_connection)
display(df);

   staff_id  MAX(total)
0         1     1391.69

## Ejercicio 5

<b>Requisito:</b>
- Haber terminado el ejercicio 4

<b>Problema: Realizar consultas <code>SELECT</code> con operaciones de JOIN </b>

Desde un entorno Python (o MySQL CLI o MySQL Workbench), realizar los comandos SQL que permiten responder a las consultas siguientes.

<b> Ayuda: http://www.mysqltutorial.org/basic-mysql-tutorial.aspx</b>

1) En las peliculas "Film" y "Language", mostrar el título de la pelicula y el nombre de su idioma. (NB: utilizar una operación de INNER JOIN)

2) Mostrar los nombres y apellidos de los clientes que han arrendado la pelicula "CHICAGO NORTH"

3) Mostrar por cada nombres y apellidos de cliente, en qué ciudad viven (tabla Customer y City)

4) Mostrar cuántas veces fueron arrendadas las peliculas (mostrando el título de la pelicula)

5) Mostrar qué pelicula generó más volumen de negocio

6) Mostrar los clientes que arrendar

1) En las peliculas "Film" y "Language", mostrar el título de la pelicula y el nombre de su idioma. (NB: utilizar una operación de INNER JOIN)

In [145]:
df = pd.read_sql('SELECT title as "Título", name as "Lenguage" FROM film as t1 INNER JOIN language as t2 '
                 + 'LIMIT 10; ', con = db_connection)
display(df);

             Título  Lenguage
0  ACADEMY DINOSAUR   English
1  ACADEMY DINOSAUR   Italian
2  ACADEMY DINOSAUR  Japanese
3  ACADEMY DINOSAUR  Mandarin
4  ACADEMY DINOSAUR    French
5  ACADEMY DINOSAUR    German
6    ACE GOLDFINGER   English
7    ACE GOLDFINGER   Italian
8    ACE GOLDFINGER  Japanese
9    ACE GOLDFINGER  Mandarin

2) Mostrar los nombres y apellidos de los clientes que han arrendado la pelicula "CHICAGO NORTH"

In [135]:
df = pd.read_sql('SELECT first_name AS "Nombre", last_name AS "Apellido", title as "Título" FROM customer AS t1 INNER JOIN film AS t2 ON t2.title = "CHICAGO NORTH" INNER JOIN inventory AS t4 ON t4.film_id = t2.film_id INNER JOIN rental AS t3 ON t3.inventory_id = t4.inventory_id AND t1.customer_id = t3.customer_id;', con = db_connection)
display(df);

      Nombre  Apellido         Título
0     ARNOLD    HAVENS  CHICAGO NORTH
1      PENNY      NEAL  CHICAGO NORTH
2     MARGIE      WADE  CHICAGO NORTH
3      ALVIN   DELOACH  CHICAGO NORTH
4     CAROLE   BARNETT  CHICAGO NORTH
5      ALVIN   DELOACH  CHICAGO NORTH
6      KATIE   ELLIOTT  CHICAGO NORTH
7     RAMONA      HALE  CHICAGO NORTH
8     ADRIAN     CLARY  CHICAGO NORTH
9        TED    BREAUX  CHICAGO NORTH
10      DALE  RATCLIFF  CHICAGO NORTH
11     CRAIG   MORRELL  CHICAGO NORTH
12  BRITTANY     RILEY  CHICAGO NORTH
13     ANNIE   RUSSELL  CHICAGO NORTH
14      JUAN    FRALEY  CHICAGO NORTH
15      ERIK   GUILLEN  CHICAGO NORTH

3) Mostrar por cada nombres y apellidos de cliente, en qué ciudad viven (tabla Customer y City)

In [154]:
df = pd.read_sql('SELECT first_name as"Nombre", last_name as "Apellido", city as "Ciudad" FROM customer as cus INNER JOIN address as ad ON cus.address_id = ad.address_id INNER JOIN city as ciudad ON ciudad.city_id = ad.city_id '
                 + 'LIMIT 20', con = db_connection)
display(df);

       Nombre  Apellido           Ciudad
0        MARY     SMITH           Sasebo
1    PATRICIA   JOHNSON   San Bernardino
2       LINDA  WILLIAMS          Athenai
3     BARBARA     JONES         Myingyan
4   ELIZABETH     BROWN           Nantou
5    JENNIFER     DAVIS           Laredo
6       MARIA    MILLER       Kragujevac
7       SUSAN    WILSON         Hamilton
8    MARGARET     MOORE           Masqat
9     DOROTHY    TAYLOR          Esfahan
10       LISA  ANDERSON       Sagamihara
11      NANCY    THOMAS     Yamuna Nagar
12      KAREN   JACKSON         Osmaniye
13      BETTY     WHITE   Citrus Heights
14      HELEN    HARRIS           Bhopal
15     SANDRA    MARTIN  Southend-on-Sea
16      DONNA  THOMPSON           Elista
17      CAROL    GARCIA           Kaduna
18       RUTH  MARTINEZ        Kimberley
19     SHARON  ROBINSON           Mardan

In [155]:
df = pd.read_sql('describe ;', con = db_connection)
display(df);

,Field,Type,Null,Key,Default,Extra
0,payment_id,smallint(5) unsigned,NO,PRI,None,auto_increment
1,customer_id,smallint(5) unsigned,NO,MUL,None,
2,staff_id,tinyint(3) unsigned,NO,MUL,None,
3,rental_id,int(11),YES,MUL,None,
4,amount,"decimal(5,2)",NO,,None,
5,payment_date,datetime,NO,,None,
6,last_update,timestamp,NO,,CURRENT_TIMESTAMP,on update CURRENT_TIMESTAMP

4) Mostrar cuántas veces fueron arrendadas las peliculas (mostrando el título de la pelicula)

In [162]:
df = pd.read_sql('SELECT title as "Título", count(*) as "N° de veces rentada" from film as t1 INNER JOIN inventory as t2 ON t1.film_id = t2.film_id INNER JOIN rental as t3 ON t3.inventory_id = t2.inventory_id GROUP BY title '
                 + 'LIMIT 10;', con = db_connection)
display(df);

             Título  N° de veces rentada
0  ACADEMY DINOSAUR                   23
1    ACE GOLDFINGER                    7
2  ADAPTATION HOLES                   12
3  AFFAIR PREJUDICE                   23
4       AFRICAN EGG                   12
5      AGENT TRUMAN                   21
6   AIRPLANE SIERRA                   15
7   AIRPORT POLLOCK                   18
8     ALABAMA DEVIL                   12
9  ALADDIN CALENDAR                   23

5) Mostrar qué pelicula generó más volumen de negocio

In [165]:
df = pd.read_sql('SELECT filmtitle as "Título", MAX(total) FROM(SELECT title AS filmtitle, sum(amount) AS total FROM sakila.payment AS t1 INNER JOIN sakila.rental AS t2 ON t1.rental_id = t2.rental_id INNER JOIN sakila.inventory AS t3 ON t3.inventory_id = t2.inventory_id INNER JOIN sakila.film AS t4 ON t4.film_id = t3.film_id GROUP BY title ORDER BY total DESC) AS tfinal;', con = db_connection)
display(df);

             Título  MAX(total)
0  TELEGRAPH VOYAGE      231.73

6) Mostrar los clientes que arrendarón por más de 10 dolares de pelicula.

In [166]:
df = pd.read_sql('SELECT customer_id, first_name as "Nombre", last_name as "Apellido", amount FROM customer INNER JOIN payment USING(customer_id) WHERE amount > 10 GROUP BY customer_id;', con = db_connection)
display(df);

     customer_id      Nombre      Apellido  amount
0              2    PATRICIA       JOHNSON   10.99
1              3       LINDA      WILLIAMS   10.99
2             12       NANCY        THOMAS   10.99
3             13       KAREN       JACKSON   11.99
4             21    MICHELLE         CLARK   10.99
5             29      ANGELA     HERNANDEZ   10.99
6             33        ANNA          HILL   10.99
7             45       JANET      PHILLIPS   10.99
8             49       JOYCE       EDWARDS   10.99
9             50       DIANE       COLLINS   10.99
10            54      TERESA        ROGERS   10.99
11            76       IRENE         PRICE   10.99
12            78        LORI          WOOD   10.99
13            86  JACQUELINE          LONG   10.99
14            87       WANDA     PATTERSON   10.99
15           104        RITA        GRAHAM   10.99
16           114       GRACE         ELLIS   10.99
17           116    VICTORIA        GIBSON   11.99
18           127      ELAINE       STEVENS   10.99
19           129      CARRIE        PORTER   10.99
20           136       ANITA       MORALES   10.99
21           140         EVA         RAMOS   10.99
22           148     ELEANOR          HUNT   10.99
23           149     VALERIE         BLACK   10.99
24           163       CATHY       SPENCER   10.99
25           168      REGINA         BERRY   10.99
26           178      MARION        SNYDER   10.99
27           187    BRITTANY         RILEY   10.99
28           195     VANESSA          SIMS   11.99
29           196        ALMA        AUSTIN   11.99
..           ...         ...           ...     ...
77           457        BILL         GAVIN   10.99
78           459       TOMMY       COLLAZO   10.99
79           460        LEON        BOSTIC   10.99
80           468         TIM          CARY   10.99
81           469      WESLEY          BULL   10.99
82           470      GORDON        ALLARD   10.99
83           477         DAN         PAINE   10.99
84           481      HERMAN        DEVORE   10.99
85           511     CHESTER        BENNER   10.99
86           516       ELMER           NOE   10.99
87           520    MITCHELL  WESTMORELAND   10.99
88           526        KARL          SEAL   10.99
89           529        ERIK       GUILLEN   10.99
90           531       JAMIE         WAUGH   10.99
91           542      LONNIE        TIRADO   10.99
92           544        CODY         NOLEN   10.99
93           545       JULIO        NOLAND   10.99
94           550         GUY      BROWNLEE   10.99
95           558      JIMMIE     EGGLESTON   10.99
96           561         IAN         STILL   10.99
97           562     WALLACE         SLONE   10.99
98           564         BOB      PFEIFFER   10.99
99           565       JAIME       NETTLES   10.99
100          567     ALFREDO       MCADAMS   10.99
101          571     JOHNNIE      CHISHOLM   10.99
102          572      SIDNEY      BURLESON   10.99
103          573       BYRON           BOX   10.99
104          591        KENT     ARSENAULT   11.99
105          592    TERRANCE         ROUSH   11.99
106          595    TERRENCE     GUNDERSON   10.99

[107 rows x 4 columns]